{
    "title": "Hello. I'm Nitin",
    "jobTitle": "Full Stack Developer",
    "aboutMe": {
        "description": "Work for organisation which provides me the opportunity to improve my skills and knowledge to grow along with fulfilment of organisational goals.",
        "yearOfExperience": "4+",
        "projectsCompleted": "10+"
    },
    "experience": [{
            "id": 1,
            "yearRange": "Sep-2021 to Present",
            "title": "Technical Lead",
            "company": "IBM | Dallas, TX, US",
            "detail": ["Energy Efficiency Contractor Portal (EEPM) project - Leading team of 5 and implementing features like login functionality, populate events in calendar, incentive calculator, etc.",
                "Diversity, Equity & Inclusion (DEI) project - Led team of 6 and implemented features like login integration with SharePoint intranet site, chat button, search bar, etc. This project was selected for 2022 Innovation Reward",
                "Oncor.com project - Led team of 15 and delivered it seamlessly with over 65 custom web pages",
                "Built and automated the Akamai Cache purge process directly from Adobe Experience Manager (AEM)",
                "Created and implemented an application on RedHat OpenShift to integrate AEM logs with Log Logic system",
                "Doing role of Admin in AEM. In addition, automated deployment from Bitbucket source code to AEM using Jenkins and CI/CD pipeline",
                "Created training materials and held training sessions for Functional Partners",
                "Planning and doing go-Live deployments for projects",
                "Leading an Agile Scrum team in designing, implementing, and releasing several projects, with code reviews and high-test coverage",
                "Working closely with Functional Partners and Project Manager to triage tickets so other developers could focus solely on coding",
                "Received lot of appreciations directly from client on every back-to-back success of projects",
                "Came onsite and joined struggling project to get that back on track and delivered it on time"
            ]
        },
        {
            "id": 2,
            "yearRange": "Dec-2020 to Aug-2021",
            "title": "Sr Web Developer",
            "company": "IBM | Pune, MH, IN",
            "detail": ["Designed and developed Market360 Executive Dashboard to monitor Market Transactions. It was built on Angular9 and NodeJS for APIs",
                "Solely responsible for design and development of WebLogic log-fetch Utility using Python. It fetches health status & mine logs for errors in each server of WebLogic Domain using REST APIs",
                "Came up with idea and designed Sentiment Analysis web application based on Self Machine Learning Model. It provides the customer experience/behavior based on their provided comments",
                "Contributed to new organization tools such as AEM, AWS and RedHat to improve throughput",
                "Deployed and managed backend applications based on RedHat OpenShift",
                "Implemented Google and Adobe Analytics to various web applications",
                "Gained experience working in a huge code base, debugging complex problems, and designing components that must interact seamlessly with numerous parts of the system",
                "Responsible for creating and maintaining core components of our day-to-day development",
                "Collaborated with project manager and creative team to deliver efficient solution, in addition advised client and provided expertise",
                "Assisted other team in developing and maintaining their web application",
                "Made attractive and professional videos for many different events conducted in IBM and Oncor",
                "Mentored junior developers to improve their technical skills"
            ]
        },
        {
            "id": 3,
            "yearRange": "Oct-2019 to Nov-2020",
            "title": "Web Developer",
            "company": "IBM | Pune, MH, IN",
            "detail": ["Designed and developed Health Planner web application which was part of IBM competition. Developed microservices using Python, implemented features like COVID data using API, diagnose X-Ray using Watson Deep Learning Algorithm. Created interactive presentation and demo video for application",
                "Rewarded with money and certification for securing 2nd position in IBM RedHatHackathonPlus2020 competition",
                "Designed and developed Outage Experience web application predicts the customer satisfaction using AI",
                "Developed customer-facing systems using AngularJS/Node.js",
                "Developed, maintained and improved web application code as per requirements",
                "Troubleshooted various IT technical difficulties for other coworkers in a quick and efficient manner which resulted in an increase in productivity",
                "Received Appreciation Certificate directly from client for performing great work"
            ]
        },
        {
            "id": 4,
            "yearRange": "Dec-2018 to Sep-2019",
            "title": "Jr Web Developer",
            "company": "IBM | Pune, MH, IN",
            "detail": ["Solely responsible for representing the Batch Performance web tool idea and worked on design, architecture, development and deployment of entire application. Many other clients also implemented this tool",
                "Batch Performance Tool is a web application which shows past trend analysis and predict batches performance using applied Machine Learning. This has patent on my name",
                "Made attractive and professional video for All Hands Meet event",
                "Learnt about Machine Learning, Deep Learning, Statistical Model, etc. from IBM provided learning platform",
                "Creative web developer for developing and optimizing interactive, user-friendly, and feature-rich websites",
                "Analytical skills to deliver modern and efficient web solutions",
                "Written clean and readable code with robust documentation for easy comprehension",
                "Awarded Manager's Choice Award for performing great work"
            ]
        },
        {
            "id": 5,
            "yearRange": "May-2018 to Nov-2018",
            "title": "Jr CC&B Developer",
            "company": "IBM | Pune, MH, IN",
            "detail": ["Created Batches, Algorithms, Business Services, Scripts, UI maps, etc.",
                "Troubleshooted the exceptions occurring in CC&B Batch code",
                "Worked as admin for CC&B Database and Middleware. Experienced in UNIX commands and scripting",
                "Designed new algorithms and scripts to automate the sanity tests like Outage creation, Meter validation, Meter read, etc. using Selenium scripting (Java Code) and Robotic Process Automation (RPA) for functional and non-functional requirements",
                "Designed, implemented and scheduled the execution of batch jobs using Computer Associates Workload Automation (CAWA)",
                "Experienced in testing web services, APIs using tools SOAPUI and Postman",
                "Awarded Best Graduate Hire for performing great work"
            ]
        },
        {
            "id": 6,
            "yearRange": "May-2017 to Apr-2018",
            "title": "Animator",
            "company": "Schoov | Gurugram, HR, IN",
            "detail": ["Worked closely with Founder & CEO of startup to achieve best quality product",
                "Created highly attractive graphic animation videos for education, incorporating stunning visuals and integrating relevant audio and video components",
                "Worked on Audacity software to clean and amplify audio",
                "Designed many advertisements to boost the startup journey",
                "Created over 120 videos using Adobe After Effect and Abobe Premier Pro",
                "Came up with innovative ideas to enhance the video experience"
            ]
        },
        {
            "id": 7,
            "yearRange": "Jan-2016 to Apr-2017",
            "title": "Graphic Designer",
            "company": "Freelancer | Remote",
            "detail": ["Created attractive infographics advertisements",
                "Created many unique and stunning pamphlets",
                "Created vector characters and icons as per requirement",
                "Won a prize from Indian government for unique designed logo"
            ]
        }
    ],
    "skills": [{
            "logo": "react.png",
            "text": "React"
        },
        {
            "logo": "angular.png",
            "text": "Angular"
        },
        {
            "logo": "html.png",
            "text": "HTML"
        },
        {
            "logo": "css.png",
            "text": "CSS"
        },
        {
            "logo": "javascript.png",
            "text": "Javascript"
        },
        {
            "logo": "adobe_experience_manager.png",
            "text": "AEM"
        },
        {
            "logo": "python.png",
            "text": "Python"
        },
        {
            "logo": "java.png",
            "text": "Java"
        },
        {
            "logo": "sql.png",
            "text": "SQL"
        },
        {
            "logo": "groovy.png",
            "text": "Groovy"
        },
        {
            "logo": "machine_learning.png",
            "text": "Machine Learning"
        },
        {
            "logo": "jupyter_notebook.png",
            "text": "Jupyter Notebook"
        },
        {
            "logo": "apache_spark.png",
            "text": "Apache Spark"
        },
        {
            "logo": "after_effects.png",
            "text": "Adobe After Effects"
        },
        {
            "logo": "premier_pro.png",
            "text": "Adobe Premier Pro"
        },
        {
            "logo": "photoshop.png",
            "text": "Adobe Photoshop"
        },
        {
            "logo": "illustrator.png",
            "text": "Adobe Illustrator"
        }
    ],
    "projects": [{
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/sentimentAnalysis/Screenshots/Artboard%204.png",
            "name": "Sentiment Analysis",
            "description": "Sentiment Analysis is a proposed design based on Self Machine Learning Model. This web application isn't built yet.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/sentimentAnalysis"
        },
        {
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/market360/Screenshots/M360_4.png",
            "name": "Market 360",
            "description": "Market 360 is an Executive Dashboard and User Interfaces to monitor / track Market Transactions.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/market360"
        },
        {
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/BatchPerformance/images/Summary.png",
            "name": "Batch Performance",
            "description": "Batch Performance is the Utility based on Dash which is Python framework for building web applications. It is built on top of Flask, Plotly.js, React and React Js. Code is written in python.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/BatchPerformance"
        },
        {
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/healthPlanner/assets/Screenshots/Web_app_1.png",
            "name": "Health Planner",
            "description": "Health Planner is a web application. It is built on top of Angular8 and React. Code is written in HTML, Typescript and Python.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/healthPlanner"
        },
        {
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/serverLogs/Screenshots/Home.png",
            "name": "WebLogic log-fetch Utility",
            "description": "The WebLogic log fetch is the Utility based on Dash which is Python framework for building web applications. It is built on top of Flask, Plotly.js, React and React Js. Code is written in python.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/serverLogs"
        },
        {
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/outagesExperience/Screenshots/SS_1.png",
            "name": "Outage Experience",
            "description": "Outage Experience is the Utility based on Dash which is Python framework for building web applications. It is built on top of Flask, Plotly.js, React and React Js. Code is written in python.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/outagesExperience"
        },
        {
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/videoSamples/Screenshots/Hackathon_demo.png",
            "name": "Video Samples",
            "description": "Below are some video samples which are created by me. I have very good experience and knowledge in tools like Adobe Photoshop, Adobe Premiere Pro, Adobe After Effects, Adobe Illustrator and CorelDRAW.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/videoSamples"
        },
        {
            "imageurl": "https://raw.githubusercontent.com/ntnnitinkr/projects/master/graphicDesigns/M360_dashboard_1.png",
            "name": "Graphic Design Samples",
            "description": "Below are some graphic design samples which are created by me. I have very good experience and knowledge in tools like Adobe Photoshop, Adobe Premiere Pro, Adobe After Effects, Adobe Illustrator and CorelDRAW.",
            "link": "https://github.com/ntnnitinkr/projects/tree/master/graphicDesigns"
        }
    ]
}